#이스케이프 문자를 사용해 문자열 만들기
print("\"안녕하세요\"라고 말했다")
print('\'배가 고픕니다\'라고 생각했다')
print("안녕하세요 \n 반갑습니다")
print("안녕하세요\t 반갑습니다")
print("\\\\\\\\")

#여러줄 문자열 만들기
print("""\
    동해물과 백두산이 마르고 닭도록
    하느님이 보우하사 우리나라 만세
    무궁화 삼천리 화려강산
    대한 사람 대한으로 길이 보전하세 
    """)

# 문자 선택 연산자의 결과 출력
print("문자 선택 연산자에 대해 알아볼까요?")
print("안녕하세요"[0])
print("안녕하세요"[1])
print("안녕하세요"[2])
print("안녕하세요"[3])
print("안녕하세요"[4])

#문자 범위 선택 연산자 결과 출력
print("안녕하세요"[0:2])
print("안녕하세요"[1:3])
print("안녕하세요"[1:])
print("안녕하세요"[:3])

#문자열 길이 구하기
print(len("안녕하세요"))
